async function loadQuestionsFromFile() {
    return {
      
        "第二章": [
            {
                question: "1. 在线性规划的模型中全部变量要求是整数。",
                answer: "错误"
            },
            {
                question: "2. 如果一个线性规划问题有两个不同的最优解，则它肯定就有无穷多个最优解。",
                answer: "正确"
            },
            {
                question: "3. 如果一个线性规划问题有可行解，就一定有最优解。",
                answer: "错误"
            },
            {
                question: "4. 线性规划的基本类型是\"max\"型问题。",
                answer: "正确"
            },
            {
                question: "5. 图解法提供了求解线性规划问题的通用方法。",
                answer: "错误"
            },
            {
                question: "6. 线性规划问题的可行解集不一定是凸集。",
                answer: "错误"
            },
            {
                question: "7. 若线性规划问题的可行域无界，则该线性规划问题一定没有最优解。",
                answer: "错误"
            },
            {
                question: "8. 若线性规划模型的可行域非空有界，则其顶点中必存在最优解。",
                answer: "正确"
            },
            {
                question: "9. 线性规划数学模型中的决策变量必须是非负的。",
                answer: "错误"
            },
            {
                question: "10. 凡具备优化、限制、选择条件且能将有关条件用关于决策变量的线性表达式表示出来的问题可以考虑用线性规划模型来处理。",
                answer: "正确"
            }
        ],
        "第三章": [
            {
                question: "1. 单纯形法是求解线性规划模型的唯一方法。",
                answer: "错误"
            },
            {
                question: "2. 用单纯形法求解线性规划问题，必须要有单位阵作为初始可行基。",
                answer: "错误"
            },
            {
                question: "3. 单纯形法的迭代计算是从一个可行解转换到目标函数值更大的另一个可行解。",
                answer: "正确"
            },
            {
                question: "4. 基本可行解的个数不会超过基本解的个数。",
                answer: "正确"
            },
            {
                question: "5 线性规划数学模型中的变量必须是非负的。",
                answer: "错误"
            },
            {
                question: "6. 若最优单纯形表中非基变量的检验数为零，则相应问题的最优解有无穷多个。",
                answer: "正确"
            },
            {
                question: "7. 在用大M法求解线性规划模型时，目标函数中人工变量的系数为-M。",
                answer: "正确"
            },
            {
                question: "8. 一旦人工变量在迭代中变为非基变量，该变量及相应的系数列就可以从单纯形中删除，而不影响计算结果。",
                answer: "正确"
            }
        ],
        "第四章": [
            {
                question: "1. 任何线性规划问题具有唯一的对偶问题。",
                answer: "正确"
            },
            {
                question: "2. 在互为对偶的一对问题与对偶问题中，不管原问题是求最大或最小，原问题可行解的目标函数值一定不超过其对偶问题可行解的目标函数值。",
                answer: "正确"
            },
            {
                question: "3. 如线性规划的原问题存在可行解，则其对偶问题也一定存在可行解。",
                answer: "错误"
            },
            {
                question: "4. 若原线性规划问题不存在可行解，则其对偶问题也不存在可行解。",
                answer: "错误"
            },
            {
                question: "5. 若原线性规划问题没有有限的最优解，则其对偶问题不存在可行解。",
                answer: "正确"
            },
            {
                question: "6. 若原问题有最优解，其对偶问题也一定有最优解。",
                answer: "正确"
            },
            {
                question: "7. 互为对偶问题，或者同时都有最优解，或者同时都无最优解。",
                answer: "正确"
            },
            {
                question: "8. 对偶问题的目标函数总是与原问题目标函数相等。",
                answer: "错误"
            },
            {
                question: "9. 在生产过程中，若某种资源未得到充分利用时，则该资源的影子价格必不为零。",
                answer: "错误"
            },
            {
                question: "10. 已知yi为线性规划的对偶问题的最优解，若yi=0说明在最优生产计划中第i种资源一定有剩余。",
                answer: "正确"
            }
        ],
        "第五章": [
            {
                question: "1. 线性规划的价值系数变化将会引起可行性发生改变。",
                answer: "错误"
            },
            {
                question: "2. 线性规划的资源向量变化将会引起最优性发生改变。",
                answer: "错误"
            },
            {
                question: "3. 线性规划的灵敏度分析就是想找到构成模型的系数在什么范围内发生改变，可使原模型求得的最优解或最优基保持不变。",
                answer: "正确"
            },
            {
                question: "4. 线性规划灵敏度分析的另一个目的就是想用最经济的方法求得系数变化超界后问题新的最优解。",
                answer: "正确"
            },
            {
                question: "5. 在进行线性规划的灵敏度分析中，为便于观察，总是假定一个参数发生变化，其余都保持不变。",
                answer: "正确"
            },
            {
                question: "6. 百分之一百法则也只能进行单一参数变化的灵敏度分析。",
                answer: "正确"
            }
        ],
        "第六章": [
            {
                question: "1. m+n-1个变量构成基变量的充要条件是其中不包含孤立点。",
                answer: "错误"
            },
            {
                question: "2. 闭回路就是首尾相接的封闭折线，其中所有的边都是水平或垂直的，每一行和每一列由相连的闭回路的顶点仅有两个。",
                answer: "正确"
            },
            {
                question: "3. 包含孤立点的变量组，其对应的系数列向量不一定线性无关。",
                answer: "正确"
            },
            {
                question: "4. 运输问题是一种特殊的线性规划问题，因此其求解思路与单纯形法相同。表上作业法仅仅是单纯形法迭代的一种简化方法。",
                answer: "正确"
            },
            {
                question: "5. 在寻找运输问题的初始基本可行解时，采用'东南角法'与采用'西北角法'一样，也能求得初始基本可行解。",
                answer: "正确"
            },
            {
                question: "6. 位势法中的'位'和'势'，其实质是运输问题对偶问题的解。",
                answer: "正确"
            },
            {
                question: "7. 运输问题是一种特殊的线性规划模型，因而求解结果也可能出现下列四种情况之一：唯一最优解；无穷多最优解；无界解；无可行解。",
                answer: "错误"
            },
            {
                question: "8. 在运输问题中，只要任意给出一组含(m+n-1)个非零的xij，且满足约束条件，就可以作为一个初始基本可行解。",
                answer: "错误"
            },
            {
                question: "9. 按最小元素法（或西北角法）给出的初始基本可行解，从每一空格（非基变量）出发可以找出而且仅能找出唯一的闭合回路。",
                answer: "正确"
            }
        ],
        "第七章": [
            {
                question: "1. 整数规划目标函数值一般优于其相应的线性规划问题的解得目标函数值。",
                answer: "错误"
            },
            {
                question: "2. 一个整数规划问题如果存在两个以上的最优解，则该问题一定有无穷多最优解。",
                answer: "错误"
            },
            {
                question: "3. 整数规划求解时可先不考虑变量的整数约束，而求解其相应的线性规划问题，然后对求解结果中为非整数的变量凑整。",
                answer: "错误"
            },
            {
                question: "4. 用分枝定界法求解一个极大化的整数规划问题，当得到多于一个可行解时，通常可任取其中一个作为下界值，再进行比较剪枝。",
                answer: "错误"
            },
            {
                question: "5. 用分枝定界法求解一个极大化的整数规划问题时，任何个可行解的目标函数值是该问题目标函数值的下界。",
                answer: "正确"
            },
            {
                question: "6. 分枝定界法在需要分枝时必须满足：一是分枝后的各子问题必须容易求解；二是各子问题解的集合必须覆盖原问题的解。",
                answer: "正确"
            },
            {
                question: "7. 求最大值的整数规划问题中，其松弛问题的最优解是整数规划问题最优解的上界。",
                answer: "正确"
            },
            {
                question: "8. 如果某个子问题的最优解（整数）已经求得，这一最优解是原整数规划问题的最优解。",
                answer: "错误"
            },
            {
                question: "9. 子问题的最优解恰好取全整数值，则该最优解也是其对应的松弛问题的最优解。",
                answer: "正确"
            },
            {
                question: "10. 用割平面法求解整数规划时，构造的割平面有可能切去一些不属于最优解的整数解。",
                answer: "正确"
            }
        ],
        "第八章": [
            {
                question: "1. 隐枚举适用于求解所有的0-1规划。",
                answer: "正确"
            },
            {
                question: "2. 0-1型整数规划的可行解就是0和1的组合。",
                answer: "正确"
            },
            {
                question: "3. 匈牙利算法是指派问题求最小值的一种求解方法。",
                answer: "正确"
            },
            {
                question: "4. 指派问题效用矩阵的每个元素都乘上同一常数k，将不影响最优指派方案。",
                answer: "正确"
            },
            {
                question: "5. 求解效益最大的指派问题，可以用指派矩阵的最小元素减去该矩阵的各元素，得到新的指派矩阵，再用匈牙利算法求解。",
                answer: "错误"
            },
            {
                question: "6. 指派问题的数学模型的形式与运输问题十分相似，故也可以用表上作业法求解。",
                answer: "正确"
            }
        ],
        "第九章": [
            {
                question: "1. 线性规划问题是目标规划问题的一种特殊形式。",
                answer: "正确"
            },
            {
                question: "2. 目标规划是针对线性规划中目标单一的局限性而建立起来的。",
                answer: "正确"
            },
            {
                question: "4. 在多目标决策问题中，当目标中规定了y≥b，为达到目标则必须同时满足y≥b，d-=0，才算达到了目标。",
                answer: "正确"
            },
            {
                question: "5. 正偏差变量应取正值，负偏差变量应取负值。",
                answer: "错误"
            },
            {
                question: "6. 目标规划模型中，应同时包含系统约束（绝对约束）与目标约束。",
                answer: "正确"
            },
            {
                question: "7. 同一目标约束中的一对偏差量中至少有一个取值为零。",
                answer: "正确"
            },
            {
                question: "8. 目标规划的目标函数中既包含决策变量又包含偏差变量。",
                answer: "错误"
            },
            {
                question: "9. 只含目标约束的目标规划模型一定存在满解。",
                answer: "正确"
            },
            {
                question: "10. 目标规划模型中的优先级P1，P2，P3，其中P1较之P2目标的重要性一般为数倍至数十倍之间。",
                answer: "错误"
            }
        ],
        "第十章": [
            {
                question: "1. 任何有n个节点n条边的简单图中必存在圈。",
                answer: "正确"
            },
            {
                question: "2. 无向图和有向图的数学表达方式完全一样。",
                answer: "错误"
            },
            {
                question: "3. 只要一条链的首尾点是同一个点，则这条链就是一条回路。",
                answer: "错误"
            },
            {
                question: "4. 去掉树T的任一条边，则它将是不连通的。",
                answer: "正确"
            },
            {
                question: "5. 如果图中从s至各点均有惟一的最短路，则连接s至其他各点的最短路在去掉重复部分后，恰好构成该图的最小支撑树。",
                answer: "错误"
            },
            {
                question: "6. 若图T是树，则T中任意两点有唯一连相连。",
                answer: "正确"
            },
            {
                question: "7. 网络最短路径是指从网络起点至终点的一条权和最小的路线。",
                answer: "正确"
            },
            {
                question: "8. Dijkstra算法可用于正权网络也可用于负权网络。",
                answer: "错误"
            },
            {
                question: "9. Dijkstra算法可以用于求解有负权的网络最短路问题。",
                answer: "错误"
            },
            {
                question: "10. 网络最大流量是网络起点至终点的一条增流链上的最大流量。",
                answer: "错误"
            },
            {
                question: "11. 图的一条链L是增流链与L是不饱和链是等价的。",
                answer: "错误"
            },
            {
                question: "12. 一个图的最小割集不是唯一的。",
                answer: "正确"
            }
        ]
    };
} 